#Task 1
#Реалізуйте генераторну функцію, яка повертатиме по одному члену числової послідовності, закон якої 
#задається за допомогою функції користувача. Крім цього параметром генераторної функції повинні бути 
#значення першого члена прогресії та кількість членів, що видаються послідовностю. Генератор повинен 
#зупинити свою роботу або по досягненню n-го члена, або при передачі команди на завершення.

def func_1(start, len_element, user_func):
    current = start
    for i in range(len_element):
        yield current
        current = user_func(current)


def user_func_1(num):
    return num + 1


f = func_1(1, 10, user_func_1)

for item in f:
    print(item)