#Task 2
#Створіть клас "Користувач", який має властивості first_name і last_name. Використайте декоратори
# @property для забезпечення доступу до цих властивостей. Визначте метод __setattr__, який забороняє 
#безпосередню зміну значень first_name і last_name. Використовуйте метод __getattr__, який повертає 
#повідомлення про те, що властивість не існує, якщо спробувати отримати доступ до неіснуючої властивості. 
#Створіть об'єкт користувача і спробуйте змінити значення first_name та отримати доступ до неіснуючої властивості.